# IFCExtrusionCreationData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExtrusionCreationData Properties
IFCExtrusionCreationData Class See Also
---
The IFCExtrusionCreationData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowVerticalOffsetOfBReps | Allows vertical shifting of breps when moving towards the origin. |
| AreInnerRegionsOpenings | True if inner regions of the extrusion should become openings, false otherwise. |
| CustomAxis | The custom extrusion axis to try when generating an extrusion. |
| ExtrusionDirection | The extrusion direction to generate an extrusion. |
| ForceOffset | True to create new local placement with identity transform. |
| HasCustomAxis | Identifies if the data contains a custom extrusion axis. |
| HasExtrusionDirection | Identifies if the data contains a extrusion direction. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PossibleExtrusionAxes | The axes to try when generating the properties of the extrusion. |
| ReuseLocalPlacement | Allows re-use of local placement when creating a new local placement due to shifting of breps when moving towards the origin. |
| ScaledArea | The area of the extrusion, scaled to the units of export. |
| ScaledHeight | The height of the extrusion, scaled to the units of export. |
| ScaledInnerPerimeter | The inner perimeter of the extrusion, scaled to the units of export. |
| ScaledLength | The length of the extrusion, scaled to the units of export. |
| ScaledOuterPerimeter | The outer perimeter of the extrusion, scaled to the units of export. |
| ScaledWidth | The width of the extrusion, scaled to the units of export. |
| Slope | The slope of the extrusion, in degrees. |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace